RT-Thread/rt-thread/bsp/freescale/platform/devices/MK22FA12/include/MK22FA12_features.h
/* @brief HOST mode enabled */
#define FSL_FEATURE_USB_KHCI_HOST_ENABLED (1)
/* @brief OTG mode enabled */
#define FSL_FEATURE_USB_KHCI_OTG_ENABLED (1)
/* @brief Size of the USB dedicated RAM */
#define FSL_FEATURE_USB_KHCI_USB_RAM (0)
/* @brief Has KEEP_ALIVE_CTRL register */
#define FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED (0)
/* @brief Has the Dynamic SOF threshold compare support */
#define FSL_FEATURE_USB_KHCI_DYNAMIC_SOF_THRESHOLD_COMPARE_ENABLED (0)
/* @brief Has the VBUS detect support */
#define FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED (0)
/* @brief Has the IRC48M module clock support */
#define FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED (0)

/* VREF module features */

/* @brief Has chop oscillator (bit TRM[CHOPEN]) */
#define FSL_FEATURE_VREF_HAS_CHOP_OSC (1)
/* @brief Has second order curvature compensation (bit SC[ICOMPEN]) */
#define FSL_FEATURE_VREF_HAS_COMPENSATION (1)
/* @brief Describes the set of SC[MODE_LV] bitfield values */
#define FSL_FEATURE_VREF_MODE_LV_TYPE (1)
/* @brief Module has also low reference (registers VREFL/VREFH) */
#define FSL_FEATURE_VREF_HAS_LOW_REFERENCE (0)

/* WDOG module features */

/* @brief Watchdog is available. */
#define FSL_FEATURE_WDOG_HAS_WATCHDOG (1)
/* @brief Has Wait mode support. */
#define FSL_FEATURE_WDOG_HAS_WAITEN (1)

/* SDHC module features */

#if defined(CPU_MK22FX512AVLK12) || defined(CPU_MK22FN1M0AVLK12) || defined(CPU_MK22FX512AVLL12) || defined(CPU_MK22FN1M0AVLL12) || \
    defined(CPU_MK22FX512AVLQ12) || defined(CPU_MK22FN1M0AVLQ12) || defined(CPU_MK22FX512AVMC12) || defined(CPU_MK22FN1M0AVMC12) || \
    defined(CPU_MK22FX512AVMD12) || defined(CPU_MK22FN1M0AVMD12)
    /* @brief Has external DMA support (register bit VENDOR[EXTDMAEN]). */
    #define FSL_FEATURE_SDHC_HAS_EXTERNAL_DMA_SUPPORT (1)
    /* @brief Has support of 3.0V voltage (register bit HTCAPBLT[VS30]). */
    #define FSL_FEATURE_SDHC_HAS_V300_SUPPORT (0)
    /* @brief Has support of 1.8V voltage (register bit HTCAPBLT[VS18]). */
    #define FSL_FEATURE_SDHC_HAS_V180_SUPPORT (0)
#endif

#endif /* __FSL_MK22FA12_FEATURES_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
